
&НаКлиенте
Процедура СвойПодбор(Команда)
	
	П = Новый Структура;
	П.Вставить("МножественныйВыбор", Истина);
	//П.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОбработкаЗакрытия = Новый ОписаниеОповещения("СвойПодборПродолжение", ЭтотОбъект);
	ОткрытьФорму("Обработка.БНСП_ВыборЦвета.Форма.ФормаВыбораЦвета", П, Элементы.СписокЦветов, , , , ОбработкаЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойПодборПродолжение(РезультатЗакрытия, ДП) Экспорт
	
	//Если РезультатЗакрытия = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Для Каждого Цвет Из РезультатЗакрытия Цикл
	//	Если СписокЦветов.НайтиПоЗначению(Цвет) <> Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	СписокЦветов.Добавить(Цвет);
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЦветовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


