
// ССЫЛКИ:
// - https://cielab.xyz/colorconv/
// - https://colorscheme.ru/color-converter.html
// - https://en.wikipedia.org/wiki/Luma_(video)

// ПОСЛЕ ЗАВЕРШЕНИЯ РАЗРАБОТКИ:
// - проверить все деления на 0
// - во всех строках использовать НСтр для ru и en
// - убрать все мусорные комментарии
// - раскидать все методы по областям
// - рефакторинг и оптимизация кода (дубли кода, длина строки не более 120 символов, количество вложенностей, кол. строк в методах, подключить систему для проверки кода на 1С:Совместимость)
// - все полезные инкапсулированные методы вынести в отдельный блок кода и описать их в статье
// - у каждого потненциально экспортного метода добавить описание по стандартам 1с
// - тщательное тестирование (особенно при различных значениях параметров)
// - перевести все на англ.
// - в статье указать на прохождение "1С:Совместимо" и перевод на англ., готово к встаиванию
// - отформатировать отсутпы по стандартам 1С

// TODO ДОП.:
// - попробовать для цветовой модели HSL сделать круг слева от регуляторов, в котором будет как то видна текущая точка цвета
//   при изменении H и S, а при изменении L будет меняться яркость круга
// - для вывода картинки hsv использовать точечную диаграмму или радарный график с фоновой картинкой
// - для метода "ПолучитьГрадиентЦветов" реализовать параметр "Линейная/Нелинейная интерполяция"

// TODO:
// - при изменении параметра cmyk, hsv, hsl меняются другие параметры, так быть не должно 
// - при выборе текущей палитры не нужно обновлять данные
// - при отсутствии цветов в навигационных панелях должно быть какое то заполнение, иначе выглядит как пустая область на форме
// - переносить строки (обрезанием) в режиме плитки, если в них есть дефис (алгоритм, расчитанный на длину строки шрифта Arial 9го кегля)
// - разрешать палитры без названий цветов
// - реализовать поиск по названию цветов среди всех доступных палитр
// - возможность передачи на форму списка произвольных палитр (соответствие, где Ключ - наименование палитры, Значение - список значений, где Значение - цвет, представление - имя цвета)
// - возможность указать доступные палитры перед открытием формы
// - возможность указать текущую палитру перед открытием формы
// - подсказки ко всем полям (напр., что такое H, что такое S, что такое V и тд)
// - реализовать режим отображения "Круг" для текущей палитры
// - проверить на каком языке получается синоним объекта метаданных (палитры)
